"""
3. Реализовать функцию my_func(), которая принимает три позиционных аргумента,
и возвращает сумму наибольших двух аргументов.
Попробуйте решить задачу двумя способами:
1) используя функцию sort()
2) без функции sort()
"""
#<function <lambda> at 0x0000020E010DAD40>

c = lambda a, b: a / b
print(c(2, 3))
